# LSActLayer

## Description
Function LSActLayer returns a handle to the last selected object on the active layer. If no objects are selected,  the function returns NIL.

```pascal
FUNCTION LSActLayer : HANDLE;
```

```python
def vs.LSActLayer():
    return HANDLE
```

## See Also
Relative calls:
* NextObj | PrevObj
* FObject | LObject
* FSActLayer | LSActLayer
* FSObject  | LActLayer
* NextDObj | PrevDObj
* NextSObj | PrevSObj

## Version
Availability: from All Versions

## Category
* Document List Handling